#ifndef UART_H                              // Блокируем повторное включение этого модуля
#define UART_H

//******************************************************************************
//  Секция include: здесь подключаются заголовочные файлы используемых модулей
//******************************************************************************

#include "conf.h"

//******************************************************************************
//  Секция определения констант
//******************************************************************************

#define UART_BOUD_RATE         		115200L
#define uartSIZE_OF_RING_BUFFER		128
#define USE_FREERTOS				//uncomment this for using freeRTOS semaphore
#define UART_NO_DATA				(-1)

#define USARTx						USART1
//#define USART_Pin_Tx				GPIO_Pin_9
//#define USART_Pin_Rx				GPIO_Pin_10
//#define USART_GPIO				GPIOA
#define USARTx_IRQHandler			USART1_IRQHandler
//#define USARTx_IRQn				USART1_IRQn

//******************************************************************************
//  Секция определения типов
//******************************************************************************

typedef struct {
	uint8_t data[uartSIZE_OF_RING_BUFFER];
	int wrIdx;
	int rdIdx;
} sRingBuf_t;

//******************************************************************************
//  Секция определения глобальных переменных
//******************************************************************************


//******************************************************************************
//  Секция прототипов глобальных функций
//******************************************************************************

void UART_Init();
void UART_SendChar(uint8_t data);
void UART_SendString(const char *str);
int UART_GetChar();

#ifdef USE_FREERTOS
int UART_GetCharBlocking();
#endif

//******************************************************************************
//  Секция определения макросов
//******************************************************************************


//******************************************************************************

#if (uartSIZE_OF_RING_BUFFER > 256)
#error "uartSIZE_OF_RING_BUFFER must be less then 256"
#endif

#endif                       // Закрывающий #endif к блокировке повторного включения

//******************************************************************************
//  ENF OF FILE
//******************************************************************************
